src/InformationRegisters/AddressClassifier.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>AddressClassifier</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Abbreviation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PostalCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AlternativeNames</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>AddressItemType</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Code</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AddressClassifierUnitCodeInCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ProvinceCodeInCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CityCodeInCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DistrictCodeInCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StreetCodeInCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/AddressClassifier/Forms/ChoiceForm/Ext/Form/Module.bsl
&AtClient
Procedure ListSelection(Item, RowSelected, Field, StandardProcessing)
	
	StandardProcessing = False;
	MakeSelection();
	
EndProcedure

&AtClient
Procedure CommandChooseRun()
	
	MakeSelection();
	
EndProcedure

&AtClient
Procedure MakeSelection()
	
	curData = Items.List.CurrentData;
	If curData = Undefined Then
		Return;
	EndIf;
	
	Result = New Structure("Description,Abbreviation", curData.Description, curData.Abbreviation);
	Close(Result);
	
EndProcedure

&AtServer
Function GetFieldsByLevel(Level)
	
	Fields = New Structure;
	Fields.Insert("Region",          ?(Level <= 1, "", Parameters.Region));
	Fields.Insert("District",        ?(Level <= 2, "", Parameters.District));
	Fields.Insert("City",            ?(Level <= 3, "", Parameters.City));
	Fields.Insert("HumanSettlement", ?(Level <= 4, "", Parameters.HumanSettlement));
	Fields.Insert("Street",          ?(Level <= 5, "", Parameters.Street));
	
	Return Fields;
	
EndFunction

&AtServer
Function GetRestrictionsByLevel(Level)
	
	Fields = GetFieldsByLevel(Level);
	Restrictions = ContactInformationManagementClassifiers.ReturnConditionsStructureByParent(Fields.Region, Fields.District, Fields.City, Fields.HumanSettlement, Fields.Street, 0);
	Restrictions.Insert("AddressItemType", Parameters.Level);
	
	Return Restrictions;
	
EndFunction

&AtServer
Procedure OnCreateAtServer(Cancellation, StandardProcessing)
	
	// Apply filter
	Parameters.Filter = GetRestrictionsByLevel(Parameters.Level);
	
	// Set current row
	Fields = GetFieldsByLevel(Parameters.Level + 1);
	FilterStructure = ContactInformationManagementClassifiers.ReturnAddressClassifierStringByAddressItem(Fields.Region, Fields.District, Fields.City, Fields.HumanSettlement, Fields.Street);
	If FilterStructure.AddressItemType = Parameters.Level Then
		Parameters.CurrentRow = InformationRegisters.AddressClassifier.CreateRecordKey(FilterStructure);
	EndIf;
	
EndProcedure
